Revit 2024 API
ParameterTypeId.RoomNumber Property
 "Number"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RoomNumber { get; }
Visual Basic
Public Shared ReadOnly Property RoomNumber As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RoomNumber {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace